{"format": "keras", "nodes": [{"name": "sequential_input", "id": "sequential_input", "class_name": "InputLayer", "output_shape": [[32, 256, 256, 3]], "num_parameters": 0}, {"name": "sequential", "id": "sequential", "class_name": "Sequential", "output_shape": [null, 256, 256, 3], "num_parameters": 0}, {"name": "sequential_1", "id": "sequential_1", "class_name": "Sequential", "output_shape": [null, 256, 256, 3], "num_parameters": 0}, {"name": "conv2d_6", "id": "conv2d_6", "class_name": "Conv2D", "output_shape": [32, 254, 254, 32], "num_parameters": 896}, {"name": "max_pooling2d_6", "id": "max_pooling2d_6", "class_name": "MaxPooling2D", "output_shape": [32, 127, 127, 32], "num_parameters": 0}, {"name": "conv2d_7", "id": "conv2d_7", "class_name": "Conv2D", "output_shape": [32, 125, 125, 64], "num_parameters": 18496}, {"name": "max_pooling2d_7", "id": "max_pooling2d_7", "class_name": "MaxPooling2D", "output_shape": [32, 62, 62, 64], "num_parameters": 0}, {"name": "conv2d_8", "id": "conv2d_8", "class_name": "Conv2D", "output_shape": [32, 60, 60, 64], "num_parameters": 36928}, {"name": "max_pooling2d_8", "id": "max_pooling2d_8", "class_name": "MaxPooling2D", "output_shape": [32, 30, 30, 64], "num_parameters": 0}, {"name": "conv2d_9", "id": "conv2d_9", "class_name": "Conv2D", "output_shape": [32, 28, 28, 64], "num_parameters": 36928}, {"name": "max_pooling2d_9", "id": "max_pooling2d_9", "class_name": "MaxPooling2D", "output_shape": [32, 14, 14, 64], "num_parameters": 0}, {"name": "conv2d_10", "id": "conv2d_10", "class_name": "Conv2D", "output_shape": [32, 12, 12, 64], "num_parameters": 36928}, {"name": "max_pooling2d_10", "id": "max_pooling2d_10", "class_name": "MaxPooling2D", "output_shape": [32, 6, 6, 64], "num_parameters": 0}, {"name": "conv2d_11", "id": "conv2d_11", "class_name": "Conv2D", "output_shape": [32, 4, 4, 64], "num_parameters": 36928}, {"name": "max_pooling2d_11", "id": "max_pooling2d_11", "class_name": "MaxPooling2D", "output_shape": [32, 2, 2, 64], "num_parameters": 0}, {"name": "flatten_1", "id": "flatten_1", "class_name": "Flatten", "output_shape": [32, 256], "num_parameters": 0}, {"name": "dense_2", "id": "dense_2", "class_name": "Dense", "output_shape": [32, 64], "num_parameters": 16448}, {"name": "dense_3", "id": "dense_3", "class_name": "Dense", "output_shape": [32, 3], "num_parameters": 195}], "edges": [["sequential_input", "sequential"], ["sequential_input", "sequential"], ["sequential", "sequential_1"], ["sequential", "sequential_1"], ["sequential_1", "conv2d_6"], ["conv2d_6", "max_pooling2d_6"], ["max_pooling2d_6", "conv2d_7"], ["conv2d_7", "max_pooling2d_7"], ["max_pooling2d_7", "conv2d_8"], ["conv2d_8", "max_pooling2d_8"], ["max_pooling2d_8", "conv2d_9"], ["conv2d_9", "max_pooling2d_9"], ["max_pooling2d_9", "conv2d_10"], ["conv2d_10", "max_pooling2d_10"], ["max_pooling2d_10", "conv2d_11"], ["conv2d_11", "max_pooling2d_11"], ["max_pooling2d_11", "flatten_1"], ["flatten_1", "dense_2"], ["dense_2", "dense_3"]]}